[Torque X2CharacterTemplate]
strCharacterName="Torque"

strCharacterBackgroundFemale[0]="Prior to joining the resistance, Torque was assigned to one of ADVENT's top kill teams, tracking down key resistance targets and eliminating them. She was content with her occupation, and thoroughly enjoyed the fight, for that she was loyal without a doubt. Only in recent months, she found herself gone rogue from her own squad, due to an operation gone extremely bad which supposedly caused her to question her allegiance to ADVENT. Not long after, she managed to join up with a resistance cell begrudgingly, and while they welcomed her with open arms, did not fully trust her to leave by herself. Fast forward to the future, Torque managed to prove herself trustworthy to join up with XCOM upon our resurgence, thus earning her place among our ranks."

[TorqueCivilian X2CharacterTemplate]
strCharacterName="Torque (Civilian)"

strCharacterBackgroundFemale[0]="Prior to joining the resistance, Torque was assigned to one of ADVENT's top kill teams, tracking down key resistance targets and eliminating them. She was content with her occupation, and thoroughly enjoyed the fight, for that she was loyal without a doubt. Only in recent months, she found herself gone rogue from her own squad, due to an operation gone extremely bad which supposedly caused her to question her allegiance to ADVENT. Not long after, she managed to join up with a resistance cell begrudgingly, and while they welcomed her with open arms, did not fully trust her to leave by herself. Fast forward to the future, Torque managed to prove herself trustworthy to join up with XCOM upon our resurgence, thus earning her place among our ranks."

[Torque_Inquisitor X2SoldierClassTemplate]
DisplayName = "Inquisitor"
ClassSummary = "A class that focuses on engaging multiple hostiles from up close, paired with crowd control and disabling isolated units or a singular enemy in the heat of battle.<br/><font color='#CA7200'>Can use Shotguns, Bullpups and Rifles as primaries, Pistols, Arc Throwers or Holotargeters as secondaries, and Swords or Combat Knifes as a Tertiary.</font>"
+AbilityTreeTitles = "Brawler"
+AbilityTreeTitles = "Biological"
+AbilityTreeTitles = "Constrictor"
+AbilityTreeTitles = "XCOM"

+RandomNickNames = "Torque"

+PhotoboothSoloBLines_Female = "Close quarters, no mercy."
+PhotoboothSoloBLines_Female = "Her bite is as strong as her wit!"
+PhotoboothSoloBLines_Female = "Close, Personal, Swift and DEADLY!"
+PhotoboothSoloBLines_Female = "'Come closer, I dare you!'"

; - Ability Templates -

; - Base Abilities -

[TorqueForceBleedout X2AbilityTemplate]
LocFriendlyName = "Torque Forced Bleedout"
LocHelpText = "Torque Forced Bleedout"
LocLongDescription = "Torque Forced Bleedout"
LocPromotionPopupText = "Torque Forced Bleedout"

[CreateTorqueUnkillable X2AbilityTemplate]
LocFriendlyName = "Torque Unkilliable Effect"
LocHelpText = "Torque Unkilliable Effect"
LocLongDescription = "Torque Unkilliable Effect"
LocPromotionPopupText = "Torque Unkilliable Effect"

[TorqueKnockoutSelf X2AbilityTemplate]
LocFriendlyName = "Torque Knockout Self"
LocHelpText = "Torque Knockout Self"
LocLongDescription = "Torque Knockout Self"
LocPromotionPopupText = "Torque Knockout Self"

[Torque_GetOverHere X2AbilityTemplate]
LocFriendlyName = "Tongue Pull"
LocLongDescription="Torque launches her tongue at a enemy, attempting to yank them to her position for a potential follow-up maneuver."
LocHelpText="Attempt to grab and pull a hostile target towards you with your tongue, allowing a follow-up attack or simply dis-placing a enemy unit. Only humans or humanoid aliens can be pulled."
LocFlyOverText="Tongue Grab"
LocMissMessage="Grab Failed!"

[Torque_FriendlyGetOverHere X2AbilityTemplate]
LocFriendlyName="Ally Tongue Pull"
LocLongDescription="Torque launches her tongue at an ally, attempting to pull them towards herself in an attempt to reposition them on the field."
LocHelpText="Grab a ally target with your tongue and pull them to a tile next to you. Doing so grants the ally a free movement action to reposition themselves, allowing for better maneuverability on the battlefield. Only humans or humanoid aliens can be pulled."
LocFlyOverText="Ally Tongue Grab"
LocMissMessage="Pull Failed!"

[Torque_Bind X2AbilityTemplate]
LocFriendlyName="Bind"
LocLongDescription="Torque's coils are inhumanly strong, more so than most other Vipers, and can bind an adjacent humanoid enemy, holding them in place and allowing Torque to decide her next attack, as long as she have the strength to maintain the bind."
LocHelpText="Bind an adjacent humanoid enemy, allowing for more bind options for you to perform."
LocFlyOverText="Bind"
LocMissMessage="Bind Failed!"

[Torque_BindSustained X2AbilityTemplate]
LocFriendlyName="Hold"
LocLongDescription="Torque holds the victim in her coils firmly, Neither crushing them or letting them go, waiting for a follow-up."
LocHelpText="Hold a target in your coils, making them have a harder time escaping, but not attempting to deal any damage or effects to the captive."
LocFlyOverText="Hold"
LocMissMessage="Bind Broken!"

[Torque_BindSustainedCrush X2AbilityTemplate]
LocFriendlyName="Crush"
LocLongDescription="Torque attempts to crush the victim in her coils, dealing damage depending on how strong Torque is, although this carries some risk of Torque losing her grip on the target, and failing the bind."
LocHelpText="Attempt to crush a target in your coils to damage them depending on how strong you are against them. Has a slightly increased chance of failing the bind, and releasing the target."
LocFlyOverText="Crush"
LocMissMessage="Crush Failed!"

[Torque_BindSustainedSubdue X2AbilityTemplate]
LocFriendlyName="Subdue"
LocLongDescription="Torque attempts to subdue the victim in her coils, dealing no damage to the target, but inflicting them with mental debuffs such as Disorientation, Stunning them or Knocking them unconscious, although this carries some risk of Torque losing her grip on the target, and failing the bind."
LocHelpText="Attempt to subdue a target in your coils to inflict certain mental debuffs depending on how strong you are against them. Has a slightly increased chance of failing the bind, and releasing the target."
LocFlyOverText="Subdue"
LocMissMessage="Subdue Failed!"

[Torque_BindSustainedChoke X2AbilityTemplate]
LocFriendlyName="Choke"
LocLongDescription="Torque attempts to choke the victim in her coils, dealing potentially less damage than crushing them, but suffocating them with a chance of knocking them unconscious, although this carries a higher risk of Torque losing her grip on the target, and failing the bind."
LocHelpText="Attempt to choke a target in your coils to damage them depending on how strong you are against them as well as potentially knocking them unconscious. Has a moderately increased chance of failing the bind, and releasing the target."
LocFlyOverText="Choke"
LocMissMessage="Choke Failed!"

[Torque_EndBind X2AbilityTemplate]
LocFriendlyName="Release Bind"
LocLongDescription="In the event the tactical situation changes, Torque can release the target in her coils, although this weakens her coils, preventing it from binding again for a short while."
LocHelpText="Release the target in your coils. Triggers a cooldown on being able to bind again."
LocFlyOverText="Release"

[Torque_EndBindAlt X2AbilityTemplate]
LocFriendlyName="Release Bind"
LocLongDescription="Upon disabling the victim in her coils, Torque releases her hold on the target, and can Bind another target without delay."
LocHelpText="Release the disabled target in your coils."
LocFlyOverText="Release"

; - Brawler -

[Inquisitor_LiveForTheFight X2AbilityTemplate]
LocFriendlyName = "Live for the fight"
LocHelpText = "Auto-Reload a limited amount of times after eliminating an enemy"
LocLongDescription = "Automatically reload your primary weapon after eliminating or neutralizing an enemy with a standard shot from your primary weapon. Can trigger <font color='#3ABD23'>2</font>/<font color='#b7bd1c'>4</font>/<font color='#d48013'>6</font> times per mission, and once per turn."
LocPromotionPopupText = "<font color='#CA7200'>LEVEL I</font> (gained at Squaddie rank [1])<br/>Reload up to <font color='#3ABD23'>2</font> times per mission:<br/><Bullet/>Can trigger once per turn.<br/><br/><font color='#CA7200'>LEVEL II</font> (gained at Captain rank [5])<br/><Bullet/>Live for the fight can now trigger <font color='#b7bd1c'>4</font> times per mission.<br/><br/><font color='#CA7200'>LEVEL III</font> (gained at Brigadier rank [8])<br/><Bullet/>Live for the fight can now trigger <font color='#d48013'>6</font> times per mission."

[Inquisitor_GiveItAnotherShot X2AbilityTemplate]
LocFriendlyName = "Give it another shot"
LocHelpText = "Fire again immediately after missing a shot"
LocLongDescription = "Upon missing a shot with your primary, fire again with a <font color='#3ABD23'>-30%</font>/<font color='#b7bd1c'>-20%</font>/<font color='#d48013'>-10%</font> chance to hit. Can trigger only once per turn."
LocPromotionPopupText = "<font color='#CA7200'>LEVEL I</font> (gained at Squaddie rank [1])<br/>Fire again after a missed shot with your primary weapon:<br/><Bullet/>Can trigger once per turn and carries a <font color='#3ABD23'>-30%</font> chance to hit.<br/><br/><font color='#CA7200'>LEVEL II</font> (gained at Captain rank [5])<br/><Bullet/>The aim penalty is reduced to <font color='#b7bd1c'>-20%</font>.<br/><br/><font color='#CA7200'>LEVEL III</font> (gained at Brigadier rank [8])<br/><Bullet/>The aim penalty is further reduced to <font color='#d48013'>-10%</font>."

[Inquisitor_GiveItAnotherShot_Passive X2AbilityTemplate]
LocFriendlyName = "Give it another shot"
LocHelpText = "Fire again immediately after missing a shot"
LocLongDescription = "Upon missing a shot with your primary, fire again with a <font color='#3ABD23'>-30%</font>/<font color='#b7bd1c'>-20%</font>/<font color='#d48013'>-10%</font> chance to hit. Can trigger only once per turn."
LocPromotionPopupText = "<font color='#CA7200'>LEVEL I</font> (gained at Squaddie rank [1])<br/>Fire again after a missed shot with your primary weapon:<br/><Bullet/>Can trigger once per turn and carries a <font color='#3ABD23'>-30%</font> chance to hit.<br/><br/><font color='#CA7200'>LEVEL II</font> (gained at Captain rank [5])<br/><Bullet/>The aim penalty is reduced to <font color='#b7bd1c'>-20%</font>.<br/><br/><font color='#CA7200'>LEVEL III</font> (gained at Brigadier rank [8])<br/><Bullet/>The aim penalty is further reduced to <font color='#d48013'>-10%</font>."

[Inquisitor_CQCExpert X2AbilityTemplate]
LocFriendlyName = "CQC Expert"
LocHelpText = "The <Ability:ClassName/> gains bonuses to critical hit chance and dodge against enemies within CQC Expert's range"
LocLongDescription = "Once per turn, standard shots within <font color='#3ABD23'>4</font>/<font color='#b7bd1c'>5</font>/<font color='#d48013'>6</font> tiles do not cost an action, Gain a free reaction against targets who act within <font color='#3ABD23'>4</font>/<font color='#b7bd1c'>5</font>/<font color='#d48013'>6</font> tiles, gain <font color='#3ABD23'>+1% to +10%</font>/<font color='#b7bd1c'>+2% to +20%</font>/<font color='#d48013'>+3% to +30%</font> bonus crit chance within proximity to targets and gain <font color='#3ABD23'>+10</font>/<font color='#b7bd1c'>+20</font>/<font color='#d48013'>+30</font> Dodge against attacks within <font color='#3ABD23'>4</font>/<font color='#b7bd1c'>5</font>/<font color='#d48013'>6</font> tiles."
LocPromotionPopupText = "<font color='#CA7200'>LEVEL I</font> (gained at Squaddie rank [1])<br/>The <Ability:ClassName/> is an expert at dealing with hostiles within close proximity to her, granting the following bonuses:<br/><Bullet/>Once per turn, refunds AP after shooting if the target is within <font color='#3ABD23'>4</font> tiles once per turn, in addition, fire a free reaction shot with your primary against any targets that move or shoot within <font color='#3ABD23'>4</font> tiles.<br/><Bullet/>Gain <font color='#3ABD23'>+1% to +10%</font> critical chance based on proximity to the target.<br/><Bullet/>Gain <font color='#3ABD23'>+10</font> dodge against attacks within <font color='#3ABD23'>4</font> tiles.<br/><br/><font color='#CA7200'>LEVEL II</font> (gained at Captain rank [5])<br/><Bullet/>The area of effect for CQC Expert is increased to <font color='#b7bd1c'>5</font> tiles.<br/><Bullet/>Dodge bonus is increased to <font color='#b7bd1c'>+20</font>.<br/><Bullet/>Critical chance is increased to <font color='#b7bd1c'>+2% to +20%</font>.<br/><br/><font color='#CA7200'>LEVEL III</font> (gained at Brigadier rank [8])<br/><Bullet/>The area of effect for CQC Expert is further increased to <font color='#d48013'>6</font> tiles.<br/><Bullet/>Dodge bonus is further increased to <font color='#d48013'>+30</font>.<br/><Bullet/>Critical chance is further increased to <font color='#d48013'>+3% to +30%</font>."

[Inquisitor_CQCExpert_Reaction X2AbilityTemplate]
LocFriendlyName = "CQC Expert"
LocHelpText = "The <Ability:ClassName/> gains bonuses to critical hit chance and dodge against enemies within CQC Expert's range"
LocLongDescription = "Once per turn, standard shots within <font color='#3ABD23'>4</font>/<font color='#b7bd1c'>5</font>/<font color='#d48013'>6</font> tiles do not cost an action, Gain a free reaction against targets who act within <font color='#3ABD23'>4</font>/<font color='#b7bd1c'>5</font>/<font color='#d48013'>6</font> tiles, gain <font color='#3ABD23'>+1% to +10%</font>/<font color='#b7bd1c'>+2% to +20%</font>/<font color='#d48013'>+3% to +30%</font> bonus crit chance within proximity to targets and gain <font color='#3ABD23'>+10</font>/<font color='#b7bd1c'>+20</font>/<font color='#d48013'>+30</font> Dodge against attacks within <font color='#3ABD23'>4</font>/<font color='#b7bd1c'>5</font>/<font color='#d48013'>6</font> tiles."
LocPromotionPopupText = "<font color='#CA7200'>LEVEL I</font> (gained at Squaddie rank [1])<br/>The <Ability:ClassName/> is an expert at dealing with hostiles within close proximity to her, granting the following bonuses:<br/><Bullet/>Once per turn, refunds AP after shooting if the target is within <font color='#3ABD23'>4</font> tiles once per turn, in addition, fire a free reaction shot with your primary against any targets that move or shoot within <font color='#3ABD23'>4</font> tiles.<br/><Bullet/>Gain <font color='#3ABD23'>+1% to +10%</font> critical chance based on proximity to the target.<br/><Bullet/>Gain <font color='#3ABD23'>+10</font> dodge against attacks within <font color='#3ABD23'>4</font> tiles.<br/><br/><font color='#CA7200'>LEVEL II</font> (gained at Captain rank [5])<br/><Bullet/>The area of effect for CQC Expert is increased to <font color='#b7bd1c'>5</font> tiles.<br/><Bullet/>Dodge bonus is increased to <font color='#b7bd1c'>+20</font>.<br/><Bullet/>Critical chance is increased to <font color='#b7bd1c'>+2% to +20%</font>.<br/><br/><font color='#CA7200'>LEVEL III</font> (gained at Brigadier rank [8])<br/><Bullet/>The area of effect for CQC Expert is further increased to <font color='#d48013'>6</font> tiles.<br/><Bullet/>Dodge bonus is further increased to <font color='#d48013'>+30</font>.<br/><Bullet/>Critical chance is further increased to <font color='#d48013'>+3% to +30%</font>."

[Inquisitor_RightBackAtYou X2AbilityTemplate]
LocFriendlyName = "Right back at you!"
LocHelpText = "The <Ability:ClassName/> returns fire at any visible target that directly damages her."
LocLongDescription = "Upon being hit by any attack, return fire with your primary weapon. This shot has a <font color='#3ABD23'>+10%</font>/<font color='#b7bd1c'>+20%</font>/<font color='#d48013'>+30%</font> chance to hit, and can trigger once per individual enemy."
LocPromotionPopupText = "<font color='#CA7200'>LEVEL I</font> (gained at Squaddie rank [1])<br/>Upon taking damage from an attack directly targeted at you, if visible, return fire with a <font color='#3ABD23'>+10%</font> chance to hit. This can trigger once per individual enemy.<br/><br/><font color='#CA7200'>LEVEL II</font> (gained at Captain rank [5])<br/><Bullet/>The bonus to hit is increased to <font color='#b7bd1c'>+20%</font>.<br/><br/><font color='#CA7200'>LEVEL III</font> (gained at Brigadier rank [8])<br/><Bullet/>The bonus to hit is further increased to <font color='#b7bd1c'>+30%</font>."

[Inquisitor_RightBackAtYou_Passive X2AbilityTemplate]
LocFriendlyName = "Right back at you!"
LocHelpText = "The <Ability:ClassName/> returns fire at any visible target that directly damages her."
LocLongDescription = "Upon being hit by any attack, return fire with your primary weapon. This shot has a <font color='#3ABD23'>+10%</font>/<font color='#b7bd1c'>+20%</font>/<font color='#d48013'>+30%</font> chance to hit, and can trigger once per individual enemy."
LocPromotionPopupText = "<font color='#CA7200'>LEVEL I</font> (gained at Squaddie rank [1])<br/>Upon taking damage from an attack directly targeted at you, if visible, return fire with a <font color='#3ABD23'>+10%</font> chance to hit. This can trigger once per individual enemy.<br/><br/><font color='#CA7200'>LEVEL II</font> (gained at Captain rank [5])<br/><Bullet/>The bonus to hit is increased to <font color='#b7bd1c'>+20%</font>.<br/><br/><font color='#CA7200'>LEVEL III</font> (gained at Brigadier rank [8])<br/><Bullet/>The bonus to hit is further increased to <font color='#b7bd1c'>+30%</font>."

[Inquisitor_MovingInFast X2AbilityTemplate]
LocFriendlyName = "Moving in fast"
LocHelpText = "The <Ability:ClassName/> gains bonus mobility in addition to bonus dodge against reaction fire."
LocLongDescription = "Gain <font color='#d48013'>+3</font> bonus mobility and receive <font color='#b7bd1c'>+25</font>/<font color='#d48013'>+50</font> dodge against all reaction fire against this unit."
LocPromotionPopupText = "<font color='#CA7200'>LEVEL I - LEVEL II</font> (gained at Squaddie rank [1])<br/>Gain <font color='#d48013'>+3</font> bonus mobility upon taking this perk, in addition to being granted <font color='#b7bd1c'>+25</font> dodge against all reaction fire.<br/><br/><font color='#CA7200'>LEVEL III</font> (gained at Brigadier rank [8])<br/><Bullet/>The bonus dodge against reaction fire is increased to <font color='#b7bd1c'>+50</font>."

[Inquisitor_UpTheStakes X2AbilityTemplate]
LocFriendlyName = "Up the stakes!"
LocHelpText = "The <Ability:ClassName/> gains bonuses to offensive and defensive stats the more enemies that are visible to her."
LocLongDescription = "Gain <font color='#b7bd1c'>+2%</font>/<font color='#d48013'>+4%</font> defense, hit and crit chance, <font color='#b7bd1c'>+3</font>/<font color='#d48013'>+6</font> dodge and <font color='#b7bd1c'>+1</font>/<font color='#d48013'>+2</font> extra crit damage for every enemy visible, up to a maximum of <font color='#b7bd1c'>+10%</font>/<font color='#d48013'>+20%</font> defense, hit and crit, <font color='#b7bd1c'>+15</font>/<font color='#d48013'>+30</font> dodge and <font color='#b7bd1c'>+3</font>/<font color='#d48013'>+6</font> crit damage."
LocPromotionPopupText = "<font color='#CA7200'>LEVEL I - LEVEL II</font> (gained at Squaddie rank [1])<br/>For every enemy visible to the shooter, gain:<br/><Bullet/><font color='#b7bd1c'>+2%</font> to hit (Max <font color='#b7bd1c'>+10%</font>).<br/><Bullet/><font color='#b7bd1c'>+2%</font> to defense (Max <font color='#b7bd1c'>+10%</font>).<br/><Bullet/><font color='#b7bd1c'>+2%</font> to crit chance (Max <font color='#b7bd1c'>+10%</font>).<br/><Bullet/><font color='#b7bd1c'>+3</font> to dodge (Max <font color='#b7bd1c'>+15</font>).<br/><Bullet/><font color='#b7bd1c'>+1</font> critical damage (Max <font color='#b7bd1c'>+3</font>).<br/><br/><font color='#CA7200'>LEVEL III</font> (gained at Brigadier rank [8])<br/>Increased bonuses per visible enemy to:<br/><Bullet/><font color='#d48013'>+4%</font> to hit (Max <font color='#d48013'>+20%</font>).<br/><Bullet/><font color='#d48013'>+4%</font> to defense (Max <font color='#d48013'>+20%</font>).<br/><Bullet/><font color='#d48013'>+4%</font> to crit chance (Max <font color='#d48013'>+20%</font>).<br/><Bullet/><font color='#d48013'>+6</font> to dodge (Max <font color='#d48013'>+30</font>).<br/><Bullet/><font color='#d48013'>+2</font> critical damage (Max <font color='#d48013'>+6</font>)."

[Inquisitor_Sidewinder X2AbilityTemplate]
LocFriendlyName = "Sidewinder"
LocHelpText = "The <Ability:ClassName/> performs half damage attack that grants her action points, depending on the result."
LocLongDescription = "A special shot that does half damage but grants a bonus move, as well as a bonus action if the result is a critical hit."
LocPromotionPopupText = "<Bullet/>Sidewinder can be used to reposition while maintaining the offense, or as a 'get out of jail free' card, should taking the fight to the enemy lead to exposing the Inquisitor.<br/><Bullet/>Deals half damage to the target.<br/><Bullet/>Grants an movement action point, regardless of the result of the attack.<br/><Bullet/>Upon landing a critical hit, the Inquisitor is granted a full action point in addition to the movement action point."

[Inquisitor_DominoEffect X2AbilityTemplate]
LocFriendlyName = "Domino Effect"
LocHelpText = "Upon eliminating an exposed enemy, the <Ability:ClassName/>'s CQC Expert's Free action, and Give it another shot's missed shot can be performed again."
LocLongDescription = "Eliminating a flanked or exposed enemy with a standard shot from your primary allows CQC Expert’s Free action, and Give it another shot to trigger again."
LocPromotionPopupText = "<Bullet/>Domino Effect allows the Inquisitor to set up a chain of kills to knock down with ease, with the right positioning of course. Paired with Predation, Domino Effect can drastically change the flow of battle. Upon killing a flanked or exposed target:<br/><Bullet/>CQC Expert's Free attack within it's AOE can trigger again.<br/><Bullet/>Give it another shot can trigger again.<br/><br/>Eliminating an enemy consists of either Killing them, making them enter bleed-out or knocking them unconscious."

; - Biological -

; - Spits -

[Inquisitor_PoisonSpit X2AbilityTemplate]
LocFriendlyName = "Poison Spit"
LocHelpText = "The Inquisitor spits out a venomous reagent that explodes into a toxic cloud, poisoning those within it's area of effect."
LocLongDescription = "The Inquisitor spits out a venomous reagent that explodes into a toxic cloud, poisoning those within it's area of effect."
LocPromotionPopupText = "The Inquisitor spits out a venomous reagent that explodes into a toxic cloud, poisoning those within it's area of effect."

[Inquisitor_FrostSpit X2AbilityTemplate]
LocFriendlyName = "Frost Spit"
LocHelpText = "The Inquisitor spits out a near sub-zero liquid that freezes all those caught in it's impact."
LocLongDescription = "The Inquisitor spits out a near sub-zero liquid that freezes all those caught in it's impact."
LocPromotionPopupText = "The Inquisitor spits out a near sub-zero liquid that freezes all those caught in it's impact."

[Inquisitor_InfernoSpit X2AbilityTemplate]
LocFriendlyName = "Inferno Spit"
LocHelpText = "The Inquisitor spits a searing hot liquid, that bursts into flame upon impact, igniting those within it's area of effect."
LocLongDescription = "The Inquisitor spits a searing hot liquid, that bursts into flame upon impact, igniting those within it's area of effect."
LocPromotionPopupText = "The Inquisitor spits a searing hot liquid, that bursts into flame upon impact, igniting those within it's area of effect."

[Inquisitor_CorrosiveSpit X2AbilityTemplate]
LocFriendlyName = "Corrosive Spit"
LocHelpText = "The Inquisitor spits an acidic reagent which explodes into a strong corrosive acid that shreds armour and burns those affected over time."
LocLongDescription = "The Inquisitor spits an acidic reagent which explodes into a strong corrosive acid that shreds armour and burns those affected over time."
LocPromotionPopupText = "The Inquisitor spits an acidic reagent which explodes into a strong corrosive acid that shreds armour and burns those affected over time."

[Inquisitor_RestorativeSpit X2AbilityTemplate]
LocFriendlyName = "Restorative Spit"
LocHelpText = "The Inquisitor spits a smart restorative healing acid that heals allies within it's impact, and inflicts mental debuffs on those that are not."
LocLongDescription = "The Inquisitor spits a smart restorative healing acid that heals allies within it's impact, and inflicts mental debuffs on those that are not."
LocPromotionPopupText = "The Inquisitor spits a smart restorative healing acid that heals allies within it's impact, and inflicts mental debuffs on those that are not."

; - Skills -

[Inquisitor_ViciousBite X2AbilityTemplate]
LocFriendlyName = "Vicious Bite"
LocHelpText = "The <Ability:ClassName/> bites an adjacent organic target as a free action, dealing significant damage and applying poison."
LocLongDescription = "Perform a free melee attack against an adjacent organic target, Poisoning them and dealing an average of <font color='#3ABD23'>3</font>/<font color='#b7bd1c'>6</font>/<font color='#d48013'>9</font> damage to the target. <font color='#3ABD23'>3</font>/<font color='#b7bd1c'>2</font>/<font color='#d48013'>1</font> turn cooldown."
LocPromotionPopupText = "<font color='#CA7200'>LEVEL I</font> (gained at Squaddie rank [1])<br/>Perform a free melee attack against an adjacent enemy:<br/><Bullet/>This attack deals <font color='#3ABD23'>3</font> damage on average, and can only target organic units.<br/><Bullet/>It has a <font color='#3ABD23'>3</font> turn cooldown.<br/><br/><font color='#CA7200'>LEVEL II</font> (gained at Captain rank [5])<br/><Bullet/>Vicious bite now deals <font color='#b7bd1c'>6</font> damage on average.<br/><Bullet/>It's cooldown is reduced to a <font color='#b7bd1c'>2</font> turn cooldown.<br/><br/><font color='#CA7200'>LEVEL III</font> (gained at Brigadier rank [8])<br/><Bullet/>Vicious bite now deals <font color='#d48013'>9</font> damage on average.<br/><Bullet/>It's cooldown is further reduced to a <font color='#d48013'>1</font> turn cooldown."

[Inquisitor_ViciousBiteCivilian X2AbilityTemplate]
LocFriendlyName = "Vicious Bite"
LocHelpText = "The <Ability:ClassName/> bites an adjacent organic target as a free action, dealing significant damage and applying poison."
LocLongDescription = "Perform a free melee attack against an adjacent organic target, Poisoning them and dealing an average of <font color='#b7bd1c'>6</font> damage to the target. <font color='#3ABD23'>3</font> turn cooldown."
LocPromotionPopupText = "<font color='#CA7200'>LEVEL I</font> (gained at Squaddie rank [1])<br/>Perform a free melee attack against an adjacent enemy:<br/><Bullet/>This attack deals <font color='#3ABD23'>3</font> damage on average, and can only target organic units.<br/><Bullet/>It has a <font color='#3ABD23'>3</font> turn cooldown.<br/><br/><font color='#CA7200'>LEVEL II</font> (gained at Captain rank [5])<br/><Bullet/>Vicious bite now deals <font color='#b7bd1c'>6</font> damage on average.<br/><Bullet/>It's cooldown is reduced to a <font color='#b7bd1c'>2</font> turn cooldown.<br/><br/><font color='#CA7200'>LEVEL III</font> (gained at Brigadier rank [8])<br/><Bullet/>Vicious bite now deals <font color='#d48013'>9</font> damage on average.<br/><Bullet/>It's cooldown is further reduced to a <font color='#d48013'>1</font> turn cooldown."

[Inquisitor_ChokingVenom X2AbilityTemplate]
LocFriendlyName = "Choking Venom"
LocHelpText = "All of the <Ability:ClassName/>'s poison effects now deal increased damage, and inflict more severe debuffs."
LocLongDescription = "Poison Effects now apply Venom (A more potent Poison effect), Dealing an extra <font color='#3ABD23'>1</font>/<font color='#b7bd1c'>2</font>/<font color='#d48013'>3</font> Damage per tick, Lasting <font color='#3ABD23'>1</font>/<font color='#b7bd1c'>2</font>/<font color='#d48013'>3</font> turns longer, increases the victim's Aim penalty to <font color='#3ABD23'>-40%</font>/<font color='#b7bd1c'>-45%</font>/<font color='#d48013'>-50%</font> and mobility penalty to <font color='#3ABD23'>-5</font>/<font color='#b7bd1c'>-6</font>/<font color='#d48013'>-7</font>."
LocPromotionPopupText = "<font color='#CA7200'>LEVEL I</font> (gained at Squaddie rank [1])<br/>All poison effects from the <Ability:ClassName/> now apply venom instead of poison:<br/><Bullet/>Poison effects last up to <font color='#3ABD23'>1</font> turn longer.<br/><Bullet/>The DOT of poison is increased by <font color='#3ABD23'>1</font> damage.<br/><Bullet/>Poison effects now apply a <font color='#3ABD23'>-40%</font> aim penalty to those affected by poison from this unit.<br/><Bullet/>Poison effects now apply a <font color='#3ABD23'>-5</font> mobility penalty to those affected by poison from this unit.<br/><br/><font color='#CA7200'>LEVEL II</font> (gained at Captain rank [5])<br/><Bullet/>Poison effects now last up to <font color='#b7bd1c'>2</font> turns longer.<br/><Bullet/>The DOT of poison is increased by <font color='#b7bd1c'>2</font> damage.<br/><Bullet/>Poison effects now apply a <font color='#b7bd1c'>-45%</font> aim penalty to those affected by poison from this unit.<br/><Bullet/>Poison effects now apply a <font color='#b7bd1c'>-6</font> mobility penalty to those affected by poison from this unit.<br/><br/><font color='#CA7200'>LEVEL III</font> (gained at Brigadier rank [8])<br/><Bullet/>Poison effects now last up to <font color='#d48013'>3</font> turns longer.<br/><Bullet/>The DOT of poison is increased by <font color='#d48013'>3</font> damage.<br/><Bullet/>Poison effects now apply a <font color='#d48013'>-50%</font> aim penalty to those affected by poison from this unit.<br/><Bullet/>Poison effects now apply a <font color='#d48013'>-7</font> mobility penalty to those affected by poison from this unit."

[Inquisitor_TagTeam X2AbilityTemplate]
LocFriendlyName = "Tag Team"
LocHelpText = "Any ally that the <Ability:ClassName/> pulls are granted a full action point."
LocLongDescription = "Ally tongue pull now grants an ally a full action, in addition to a movement action. Can only trigger once per ally."
LocPromotionPopupText = "<Bullet/>Allies pulled with Ally tongue pull are granted both a movement action, and a full action, allowing the <Ability:ClassName/> to quickly reposition them while granting them better offensive capabilities to follow-up after being pulled."

[Inquisitor_ElementalAugmentation X2AbilityTemplate]
LocFriendlyName = "Elemental Augmentation"
LocHelpText = "The <Ability:ClassName/> is now capable of using frost and inferno spits."
LocLongDescription = "Gives access to Frost and Inferno Spit, which cooldowns are shared with all spit types. Frost Spit allows you to freeze enemies in place temporarily as well as freeze rulers for <font color='#3ABD23'>2</font>/<font color='#b7bd1c'>4</font>/<font color='#d48013'>6</font> actions within it’s AOE. Inferno Spit sets targets within It’s AOE on fire, dealing an average of <font color='#3ABD23'>2</font>/<font color='#b7bd1c'>3</font>/<font color='#d48013'>4</font> damage per turn, and disabling most offensive actions."
LocPromotionPopupText = "<font color='#CA7200'>LEVEL I</font> (gained at Squaddie rank [1])<br/>With Elemental Augmentation, the <Ability:ClassName/> gains access to two new types of spits, Frost spit and Inferno spit, which share a cooldown with all spit types:<br/><Bullet/>Frost spit has the ability to freeze any targets that are caught in it's AOE temporarily, in addition to freezing rulers for <font color='#3ABD23'>2</font> reactions.<br/><Bullet/>Inferno spit ignites the AOE with fire, setting anyone within it's radius on fire, dealing an average of <font color='#3ABD23'>2</font> damage per turn, in addition of disabling most actions of those affected.<br/><br/><font color='#CA7200'>LEVEL II</font> (gained at Captain rank [5])<br/><Bullet/>Frost spit now freezes rulers for <font color='#b7bd1c'>4</font> reactions.<br/><Bullet/>Inferno spit now deals an average of <font color='#b7bd1c'>3</font> damage per turn.<br/><br/><font color='#CA7200'>LEVEL III</font> (gained at Brigadier rank [8])<br/><Bullet/>Frost spit now freezes rulers for <font color='#d48013'>6</font> reactions.<br/><Bullet/>Inferno spit now deals an average of <font color='#d48013'>4</font> damage per turn."

[Inquisitor_PassiveAggression X2AbilityTemplate]
LocFriendlyName = "Passive Aggression"
LocHelpText = "Using spit actions are now free actions for the <Ability:ClassName/>."
LocLongDescription = "Using a spit ability is now a free action."
LocPromotionPopupText = "<Bullet/>Using any spit action will no longer cost an action for the <Ability:ClassName/>, although one will obviously still need an action point to use a spit, Cause you can't spit at all if you don't have one..."

[Inquisitor_VenomManipulation X2AbilityTemplate]
LocFriendlyName = "Venom Manipulation"
LocHelpText = "The <Ability:ClassName/> is now capable of using corrosive and restorative spits."
LocLongDescription = "Gives access to Restorative and Corrosive Spit, which cooldowns are shared with all spit types. Restorative Spit allows you to heal allies for <font color='#d48013'>+5</font> HP within it’s AOE, and can inflict mental debuffs on organic units. Corrosive Spit Shreds <font color='#b7bd1c'>1</font>/<font color='#d48013'>2</font> Armour on hit, in addition to an average of <font color='#b7bd1c'>2</font>/<font color='#d48013'>4</font> damage per turn."
LocPromotionPopupText = "<font color='#CA7200'>LEVEL I - Level II</font> (gained at Squaddie rank [1])<br/>With Venom Manipulation, the <Ability:ClassName/> gains access to two new types of spits, Corrosive spit and Restorative spit, which share a cooldown with all spit types:br/>Corrosive spit inflicts the Acid debuff for those caught in it's blast, as well as those who traverse the affected area:<br/><Bullet/>Corrosive spit shreds <font color='#b7bd1c'>1</font> armour on impact and deals an average of <font color='#b7bd1c'>2</font> damage per turn to those in it's AOE.<br/>Restorative spit has a much smaller AOE, but can heal affected allies for <font color='#d48013'>+5</font> HP.<br/><Bullet/>Restorative spit has a <font color='#b7bd1c'>75%</font> chance to disorientate and a <font color='#b7bd1c'>25%</font> chance to stun affected enemies for <font color='#b7bd1c'>2</font> turns.<br/><br/><font color='#CA7200'>LEVEL III</font> (gained at Brigadier rank [8])<br/><Bullet/>Corrosive spit now shreds <font color='#b7bd1c'>2</font> armour on impact and now deals an average of <font color='#b7bd1c'>4</font> damage per turn.<br/><Bullet/>Restorative spit now has a <font color='#d48013'>100%</font> chance to disorientate and has a <font color='#d48013'>50%</font> chance to stun affected enemies for <font color='#d48013'>4</font> turns.<br/><Bullet/>Restorative spit now has a <font color='#d48013'>25%</font> chance to knock affected enemies unconscious."

[Inquisitor_PrehensilePower X2AbilityTemplate]
LocFriendlyName = "Prehensile Power"
LocHelpText = "The <Ability:ClassName/> can now pull targets from further away, in addition to those in full cover."
LocLongDescription = "Tongue pull can now hit from <font color='#b7bd1c'>+3</font>/<font color='#d48013'>+6</font> tiles further, and can pull targets from full cover."
LocPromotionPopupText = "<font color='#CA7200'>LEVEL I - Level II</font> (gained at Squaddie rank [1])<br/>Prehensile Power allows the <Ability:ClassName/> to pull targets from <font color='#b7bd1c'>+3</font> tiles further, in addition to being able to pull those in high cover.<br/><br/><font color='#CA7200'>LEVEL III</font> (gained at Brigadier rank [8])<br/>Prehensile Power now increases Tongue pull's range by <font color='#d48013'>+6</font> tiles."

[Inquisitor_Predation X2AbilityTemplate]
LocFriendlyName = "Predation"
LocHelpText = "Upon pulling a target, the <Ability:ClassName/> marks them, and upon eliminating them, can pull again without cooldown."
LocLongDescription = "Pulling an enemy now marks them, making it easier to hit them, and making tongue pull available immediately upon eliminating the marked target."
LocPromotionPopupText = "<Bullet/>Predation allows the <Ability:ClassName/> to quickly chain together eliminations while remaining in an advantageous position. Combined with Domino Effect, this can lead to large kill chains of weaker or injured enemies, as long as the <Ability:ClassName/> has the ammo."

; - Constructor -

[Inquisitor_Entwine X2AbilityTemplate]
LocFriendlyName = "Entwine"
LocHelpText = "While binding an enemy, the <Ability:ClassName/> gains bonus defense, as long as the bind is maintained."
LocLongDescription = "Gain <font color='#3ABD23'>+5</font>/<font color='#b7bd1c'>+15</font>/<font color='#d48013'>+30</font> defense while binding."
LocPromotionPopupText = "<font color='#CA7200'>LEVEL I</font> (gained at Squaddie rank [1])<br/>While sustaining a bind, the <Ability:ClassName/> gains a bonus <font color='#3ABD23'>+5</font> defense, making it harder to hit her while she maintains the bind.<br/><br/><font color='#CA7200'>LEVEL II</font> (gained at Captain rank [5])<br/><Bullet/>The defense bonus while binding is increased to <font color='#b7bd1c'>+15</font>.<br/><br/><font color='#CA7200'>LEVEL III</font> (gained at Brigadier rank [8])<br/><Bullet/><br/><Bullet/>The defense bonus while binding is further increased to <font color='#d48013'>+30</font>."

[Inquisitor_ImmenseGrasp X2AbilityTemplate]
LocFriendlyName = "Immense Grasp"
LocHelpText = "While binding an enemy, the <Ability:ClassName/> gains bonus strength, as long as the bind is maintained."
LocLongDescription = "Gain <font color='#3ABD23'>+15</font>/<font color='#b7bd1c'>+30</font>/<font color='#d48013'>+45</font> bonus strength while binding."
LocPromotionPopupText = "<font color='#CA7200'>LEVEL I</font> (gained at Squaddie rank [1])<br/>While sustaining a bind, the <Ability:ClassName/> gains a bonus <font color='#3ABD23'>+15</font> strength, making it much harder for her bind to break while sustaining it, in addition to a higher chance of stronger effects from sustaining a bind.<br/><br/><font color='#CA7200'>LEVEL II</font> (gained at Captain rank [5])<br/><Bullet/>The strength bonus while binding is increased to <font color='#b7bd1c'>+30</font>.<br/><br/><font color='#CA7200'>LEVEL III</font> (gained at Brigadier rank [8])<br/><Bullet/><br/><Bullet/>The strength bonus while binding is further increased to <font color='#d48013'>+45</font>."

[Inquisitor_ReinforcedScales X2AbilityTemplate]
LocFriendlyName = "Reinforced Scales"
LocHelpText = "While binding an enemy, the <Ability:ClassName/> gains bonus armour, as long as the bind is maintained."
LocLongDescription = "Gain <font color='#3ABD23'>+2</font>/<font color='#b7bd1c'>+4</font>/<font color='#d48013'>+6</font> armour mitigation while binding."
LocPromotionPopupText = "<font color='#CA7200'>LEVEL I</font> (gained at Squaddie rank [1])<br/>While sustaining a bind, the <Ability:ClassName/> gains a bonus <font color='#3ABD23'>+2</font> armour mitigation, Both making it more safe to bind in the middle of a fight, and making it harder for the bind to be broken via damage.<br/><br/><font color='#CA7200'>LEVEL II</font> (gained at Captain rank [5])<br/><Bullet/>The armour mitigation bonus while binding is increased to <font color='#b7bd1c'>+4</font>.<br/><br/><font color='#CA7200'>LEVEL III</font> (gained at Brigadier rank [8])<br/><Bullet/>The armour mitigation bonus while binding is further increased to <font color='#d48013'>+6</font>."

[Inquisitor_StrengthenedCoils X2AbilityTemplate]
LocFriendlyName = "Strengthened Coils"
LocHelpText = "The <Ability:ClassName/> no longer triggers cooldowns on sustained bind actions, allowing multiple uses per turn."
LocLongDescription = "Crushing, Choking or Subduing a target now can be used multiple times per turn, instead of just once."
LocPromotionPopupText = "<Bullet/>Sustained bind actions, such as Crush, Choke and Subdue, no longer suffer from any cooldowns.<br/><Bullet/>This allows the <Ability:ClassName/> to sustain her bund multiple times per turn, instead of just once."

[Inquisitor_TakingRisks X2AbilityTemplate]
LocFriendlyName = "Taking Risks"
LocHelpText = "Ending a bind manually grants the <Ability:ClassName/> a free movement action."
LocLongDescription = "Gain a free movement action when manually ending a bind. Can only trigger once per turn."
LocPromotionPopupText = "<Bullet/>Taking Risks helps the <Ability:ClassName/> to easily reposition, if she finds herself in an unfavorable predicament while binding."

[Inquisitor_SwiftAndDeadly X2AbilityTemplate]
LocFriendlyName = "Swift And Deadly"
LocHelpText = "Binding no longer costs an action for the <Ability:ClassName/>, in addition to broken binds no longer putting bind on cooldown."
LocLongDescription = "Bind is now a free action, and no longer suffers from a cooldown when broken."
LocPromotionPopupText = "<Bullet/>When the <Ability:ClassName/>'s bind is broken due to a failed sustained action, it will no longer cause bind to enter cooldown. Hoverer, It still will have a cooldown if broken on the turn of binding someone.<br/><Bullet/>Bind as a free action allows the <Ability:ClassName/> to guarantee a sustained bind action on the turn of binding an enemy."

[Inquisitor_OnToTheNext X2AbilityTemplate]
LocFriendlyName = "On to the next!"
LocHelpText = "When the <Ability:ClassName/> eliminates an enemy she has bound, she is granted an action point."
LocLongDescription = "Eliminating or neutralizing a bound target grants you 1 action point."
LocPromotionPopupText = "<Bullet/>On to the next can be both use aggressively or defensively.<br/><Bullet/>It can be used to reposition, if the <Ability:ClassName/> finds herself exposed after finishing a bind, or to push onto the next group of enemies without delay."

; - Items -
[Inquisitor_MAW_I X2WeaponTemplate]
FriendlyName="M.A.W Alpha (Weakened)"
FriendlyNamePlural="M.A.W Alphas (Weakened)"
BriefSummary="An unique M.A.W implant designed specifically for Torque, by ADVENT, in attempts to unleash her ability to use multiple spit variants at will, without requiring a completely new implant to be installed. With her defection to XCOM however, the implant has been weakened in strength, preventing her from using it at it's peak capacity."
TacticalText="<Bullet/> Allows Torque to use her tongue pull and spits.\n<Bullet/> With future technological advancements, we suspect we can help restore her implant to full capacity."

[Inquisitor_MAW_II X2WeaponTemplate]
FriendlyName="M.A.W Alpha Mark II"
FriendlyNamePlural="M.A.W Alpha Mark IIs"
BriefSummary="With more knowledge on the M.A.W's inner workings, we were able to restore Torque's M.A.W implant to it's original capacity. This should stop her from complaining about faulty implants now... Hopefully..."
TacticalText="<Bullet/> Allows Torque to use her tongue pull and spits.\n<Bullet/> Improvements to various components on the implant have allowed us to restore it to it's full capacity once again.\n<Bullet/> We suspect that we might be able to improve further on the design, once we have the appropriate knowledge to do so."

[Inquisitor_MAW_III X2WeaponTemplate]
FriendlyName="M.A.W Alpha Mark III"
FriendlyNamePlural="M.A.W Alpha Mark IIIs"
BriefSummary="Further improvements to it's design, and some angry comments about 'It being too 'alien' looking' from Torque, We designed a much more powerful M.A.W implant for Torque. With this, Torque's spits are now more potent in their effectiveness."
TacticalText="<Bullet/> Allows Torque to use her tongue pull and spits.\n<Bullet/> With further knowledge, we were able to improve the M.A.W implant to succeed the original's power."

[Inquisitor_MAW_II_Schematic X2SchematicTemplate]
m_strClassLabel="INQUISITOR"
[Inquisitor_MAW_III_Schematic X2SchematicTemplate]
m_strClassLabel="INQUISITOR"

[Country_Torque X2CountryTemplate]
DisplayName="Siberia"
DisplayNameWithArticle="Siberia"
DisplayNameWithArticleLower="Siberia"
DisplayNamePossessive="Siberia's"
DisplayAdjective="Siberian"
